/************************************************************************
3-13 20:42 µ÷ÊÔOK
¿É¼ÆÊı
¿ÉÇĞ»»ËÄÖÖÄ£Ê½
******************************************************************************/

#include "input.h"

extern u32 MJ_Cnt;	//¿ªÄ£¼ÆÊı
extern u32 YG_Cnt;	//Ô±¹¤¿ªÄ£¼ÆÊı
extern u8  USART3_SendWorld;
extern u8 RUN_STATE;
extern u8 Mode_STATE;

u8  Input_Flag=0;			//ÊäÈëÏà¹Ø±êÖ¾Î»
u8  Input_Timer=0;			//ÊäÈë²É¼¯¼ÆÊ±
u8  Input1_Cnt=0;			//1¹Ü½ÅÊäÈë
u8  Input13_Cnt=0;			//2¹Ü½ÅÊäÈë
u8  Input14_Cnt=0;			//3¹Ü½ÅÊäÈë
u8  Input4_Cnt=0;			//4¹Ü½ÅÊäÈë
u16 Input_State=0;			//µ±Ç°ÊäÈë×´Ì¬
u16 Old_Input_State=0;		//ÉÏÒ»Ê±¿ÌÊäÈë×´Ì¬
u16 Input_Rising_Edge=0;	//ÊäÈëÉÏÉıÑØ
u16 Input_Falling_Edge=0;	//ÊäÈëÏÂ½µÑØ

u8  Old_Flag = 0;
u8  Flag = 4;

u8  Input2_LowLevel_Flag = 0;
u8  Input2_HighLevel_Flag = 0;

u8  Input3_LowLevel_Flag = 0;
u8  Input3_HighLevel_Flag = 0;

u8  Input4_LowLevel_Flag = 0;
u8  Input4_HighLevel_Flag = 0;

u8  Auto_Flag=0;

u8  AutoMode_Flag;
u8  SemiAutoMode_Flag;
u8  ManualMode_Flag;

u8  doorOpenTimer = 0;
u8  doorCloseTimer = 0;
u8  doorOpenFlag = 0;
u8  doorCloseFlag = 0;

u32  doorCloseCounter = 0;
u32  doorOpenCounter = 0;
u8  disturbDoorOpen = 0;
u8  doorOpenCS = 0;
u8  Timer = 0;
/********************************************************************************************************
	º¯ÊıÃû£ºInput_InputStateCollect()
	Ëµ  Ã÷£º
	¹¦  ÄÜ£º¿ªÄ£Êı¾İµÄ24VÊäÈëÒı½Å£¨CN1µÄ1¡¢2½Å24VÊäÈë¶Ë£©µÄÉÏÉı¡¢ÏÂ½µÑØÂö³åĞÅºÅµÄ²É¼¯
	        Ñ¹Öı»úAC_220VµçÔ´Í¨¶ÏĞÅºÅ£¨¼´CN4µÄ1¡¢2½ÅIN1_AC220VÊäÈë£©µÄ²É¼¯
			ÈÛÂ¯AC_220VµçÔ´Í¨¶ÏĞÅºÅ£¨¼´CN4µÄ1¡¢3½ÅIN1_AC220VÊäÈë£©µÄ²É¼¯
	Êä  Èë£ºÎŞ
	Êä  ³ö£ºÎŞ

	INPUT1--¿ªÄ£¼ÆÊı
	INPUT2--×Ô¶¯¡¢ÊÖ¶¯Ä£Ê½¼ì²â    ĞèÒª×Ô¶¯Ä£Ê½Ê±INPUT2Ê¼ÖÕÎªµÍ
	INPUT4--ÏµÍ³µçÔ´¼ì²â
**********************************************************************************************************/
void Input_InputStateCollect()
{
	if(GPIO_ReadInputDataBit(INPUT1)==0)  	//µ±É¨Ãèµ½INPUT1£¬¼´GPIOC, GPIO_Pin_3Òı½ÅÎªµÍµçÆ½£¬É¨ÃèÆµÂÊ1´Î/ms
		Input1_Cnt++;						//É¨Ãèµ½µÍµçÆ½µÄ´ÎÊı¼Ó1
	
//Í¨¹ıÇ°ÃÅĞÅºÅÅĞ¶ÏÄ£Ê½£¬Ç°ÃÅÒ»Ö±¹ØÊ±Îª×Ô¶¯Ä£Ê½£¬´ËÊ±¿ØÖÆ¿ØÖÆÆ÷ÊäÈë24V£¬INPUT2Ó¦Îª0
//Ç°ÃÅÓĞ¿ªÊ±ÎªÊÖ¶¯Ä£Ê½£¬´ËÊ±¿ØÖÆÊäÈë0V£¬INPUT2Ó¦Îª1
//×Ô¶¯ÊÖ¶¯ÅĞ¶ÏÂß¼­£º
//µ±¼ì²âµ½³ÖĞø´ï4ÃëµÄ¿ªÃÅĞÅºÅÊ±£¬ËµÃ÷ÊÇÓĞÈË´ò¿ªÁËÇ°ÃÅ£¬ÓÉ´ËÅĞ¶ÏÎªÊÖ¶¯Ä£Ê½
//µ±¼ì²âµ½³ÖĞø´ï100ÃëµÄ¹ØÃÅĞÅºÅÊ±£¬ËµÃ÷Ç°ÃÅÊ¼ÖÕ´¦ÓÚ¹Ø±Õ×´Ì¬£¬ÓÉ´ËÅĞ¶ÏÎª×Ô¶¯Ä£Ê½
//ÔÚ¼ì²â100ÃëµÄ¹ØÃÅĞÅºÅÆÚ¼ä£¬¿ÉÄÜ»áÊÜµ½³ÖĞøÊ±¼äĞ¡ÓÚ4ÃëµÄ¿ªÃÅĞÅºÅ¸ÉÈÅ£¬´ËÊ±½«¸ÉÈÅºöÂÔ£¬¼ÌĞø¼ÆÊı£¬Ö±ÖÁ´ïµ½100Ãë
	if(GPIO_ReadInputDataBit(INPUT2) == 1) 	//µ±É¨Ãèµ½INPUT2Îª¸ß£¨¿ªÃÅĞÅºÅ£©£¬¼´GPIOA, GPIO_Pin_1Òı½ÅÎªµÍµçÆ½£¬É¨ÃèÆµÂÊ1´Î/ms
	{//¿ªÃÅ,ÊÖ¶¯
         doorOpenTimer++;      //¿ªÃÅ¼ÆÊıÆ÷¿ªÊ¼¼ÆÊı
    }
	else//¹ØÃÅ,×Ô¶¯¯
    { 
         doorCloseTimer++;     //¹ØÃÅ¼ÆÊıÆ÷¿ªÊ¼¼ÆÊı
    }

	if(GPIO_ReadInputDataBit(INPUT4)==0) 	//µ±É¨Ãèµ½INPUT13£¬¼´GPIOE, GPIO_Pin_11Òı½ÅÎªµÍµçÆ½£¬É¨ÃèÆµÂÊ1´Î/ms
		{ Input3_LowLevel_Flag = 1; }
	else
		{ Input3_HighLevel_Flag = 1;}

	if(GPIO_ReadInputDataBit(INPUT3)==0) 	//ÏµÍ³µçÔ´É¨Ãè
		Input4_Cnt++;						//É¨Ãèµ½µÍµçÆ½µÄ´ÎÊı¼Ó1

	Old_Input_State=Input_State;	        //±£´æÉÏÒ»É¨ÃèÊ±¿ÌµÄÊäÈëµçÆ½×´Ì¬
	
	Input_Timer++;							//É¨Ãè¼ÆÊıÆ÷¼Ó1£¬ÒòÉ¨ÃèÆµÂÊÎª1´Î/ms£¬¹Ê´Ë¼ÆÊıÆ÷Ã¿ºÁÃë¼Ó1
//    Timer++;

	if(Input_Timer >= 50)						//ÈôÉ¨Ãè´ÎÊı´ïµ½30£¬¼´30msÒÔÄÚ
	{
//-----------------------INPUT1-----------------------
		if(Input1_Cnt >= 35)					//ÔÚ30msÒÔÄÚ£¬ÈôÉ¨Ãèµ½µÍµçÆ½µÄ´ÎÊı´ïµ½15£¬ÔòÖ¤Ã÷¸ÃÒı½ÅÊäÈëÁËÓĞĞ§µÄµÍµçÆ½
		{
			Input_State |= 0x0001;	        //½«ÊäÈë×´Ì¬ÖÃ0x0001£¬±íÃ÷¸ÃÒı½ÅÊäÁËÓĞĞ§µÄµÍµçÆ½
		}
		else							    //ÔÚ30msÒÔÄÚ£¬ÈôÉ¨Ãèµ½µÍµçÆ½µÄ´ÎÊıĞ¡ÓÚ15£¬ÔòÖ¤Ã÷¸ÃÒı½ÅÊäÈëÁËÓĞĞ§µÄ¸ßµçÆ½
		{
			Input_State &= 0xFFFE;	        //½«ÊäÈë×´Ì¬ÖÃÎª·ÇµÍ£¬¼´¸ßµçÆ½
		}
		
        if(doorOpenTimer >= 35)
        {//¼ì²âµ½Ò»´ÎÓĞĞ§µÄ¿ªÃÅĞÅºÅ
             doorOpenTimer = 0;
             doorCloseTimer = 0;

             doorOpenCounter++;

             printf("doorOpenCounter = %d\r\n",doorOpenCounter);

             if( doorOpenCounter >= 4 * 20 )  //¼ì²âµ½¿ªÃÅµÄÊ±¼ä´ïµ½4ÃëÖÓ
             {
                doorOpenCounter = 0;
                doorOpenFlag = 1 ;           //ÖÃ¿ªÃÅ±êÖ¾
                doorCloseFlag = 0;           //Çå³ı¹ØÃÅ±êÖ¾
                doorCloseCounter = 0;                
             }
        }
         if(doorCloseTimer >= 35)
        {//¼ì²âµ½Ò»´ÎÓĞĞ§µÄ¹ØÃÅĞÅºÅ
             doorCloseTimer = 0;
             doorOpenTimer = 0;

             doorCloseCounter ++ ;    //¼ì²âµ½ÓĞĞ§¹ØÃÅĞÅºÅµÄ´ÎÊı

             printf("&&&&doorCloseCounter = %d\r\n",doorCloseCounter);

             doorOpenCounter = 0;     //Çå³ı¿ªÃÅ¼ÆÊı£¬·ÀÖ¹ÆäÀÛ¼Ó£¬¿ÉÂË³ı¹ØÃÅÆÚ¼äµÄ¿ªÃÅĞÅºÅ¸ÉÈÅ
             
             if( doorCloseCounter >= 100 * 20 )  //¼ì²âµ½¹ØÃÅµÄÊ±¼ä´ïµ½100Ãë
             {
                 doorOpenFlag = 0 ; 
                 doorCloseFlag = 1;

                 doorCloseCounter = 0; 
//               doorOpenCounter = 0;                                   
             }
        }
       
    
		if(Input4_Cnt >= 35)				//ÔÚ30msÒÔÄÚ£¬ÈôÉ¨Ãèµ½µÍµçÆ½µÄ´ÎÊı´ïµ½8£¬ÔòÖ¤Ã÷¸ÃÒı½ÅÊäÈëÁËÓĞĞ§µÄµÍµçÆ½
		{
 			//printf("ÊäÈë¹Ü½Å13ÔÚe20ms²É¼¯µ½µÄ´ÎÊıÎª:%u\r\n",Input13_Cnt);
			Input_State |= 0x1000;	        //½«ÊäÈë×´Ì¬ÖÃ0x1000£¬±íÃ÷¸ÃÒı½ÅÊäÈëÁËÓĞĞ§µÄµÍµçÆ½
		}
		else								//ÔÚ30msÒÔÄÚ£¬ÈôÉ¨Ãèµ½µÍµçÆ½µÄ´ÎÊıĞ¡ÓÚ8£¬ÔòÖ¤Ã÷¸ÃÒı½ÅÊäÈëÁËÓĞĞ§µÄ¸ßµçÆ½
		{//ÊäÈë¹Ü½Å13ÎŞĞ§
			Input_State &= 0xEFFF;	        //½«ÊäÈë×´Ì¬ÖÃÎª·ÇµÍ£¬¼´¸ßµçÆ½
		}

		Input_Edge();	                    //ÊäÈëÉÏÉıÑØ¡¢ÏÂ½µÑØµÄÅĞ¶Ï
		
		Input1_Cnt=0;
		Input4_Cnt=0;	                    //Í³¼ÆÊı¾İÇåÁã
		Input_Timer=0; 
	}

}

/**************************************************************************************************
	º¯ÊıÃû£º Input_Edge(void)
	Ëµ  Ã÷£º Í¨¹ıOld_Input_StateÓëInput_State¶şÕßµÄ²îÒì±È½ÏÀ´½øĞĞÅĞ¶Ï
		 
	¹¦  ÄÜ£º ÅĞ¶Ï24V¿ªÄ£Êı¾İ¡¢Ñ¹Öı»úÍ¨¶ÏµçĞÅºÅ¡¢ÈÛÂ¯Í¨¶ÏµçĞÅºÅµÄÉÏÉıÑØ¡¢ÏÂ½µÑØ£¬´Ë´¦µÄÉÏÉıÏÂ½µÑØ
	         ÎªÊµ¼Ê×´Ì¬£¬·´Ó¦µ½³ÌĞòÖĞÔòÊÇÊµ¼Ê×´Ì¬Í¨¹ı¹âñîÈ¡·´ºóµÃµ½µÄ×´Ì¬
***************************************************************************************************/
void Input_Edge(void)
{
/************¿ªÄ£Êı¾İ--INPUT1--ÉÏÉıÑØ¡¢ÏÂ½µÑØµÄÅĞ¶Ï*********************/
	if(((Old_Input_State & 0x0001)==0) && (Input_State & 0x0001))     //µ±Old_Input_StateÎª0xFFFE£¨¼´¸ßµçÆ½£©ÇÒInput_StateÎª0x0001£¨¼´µÍµçÆ½£©Ê±	
	{
		Input_Rising_Edge |=0x0001;							          //24V¿ªÄ£Êı¾İ²úÉúÁËÒ»¸öÉÏÉıÑØ
	}
	else if((Old_Input_State & 0x0001) && ((Input_State & 0x0001)==0))//µ±Old_Input_StateÎª0x0001£¨¼´µÍµçÆ½£©ÇÒInput_StateÎª0xFFFE£¨¼´¸ßµçÆ½£©Ê±		
	{
		Input_Falling_Edge |=0x0001;								  //24V¿ªÄ£Êı¾İ²úÉúÁËÒ»¸öÏÂ½µÑØ
	}
/************Ñ¹Öı»úµçÔ´Í¨¶ÏĞÅºÅÉÏÉıÑØ¡¢ÏÂ½µÑØµÄÅĞ¶Ï**************/
	if(((Old_Input_State & 0x1000)==0) && (Input_State & 0x1000))     //µ±Old_Input_StateÎª0xEFFF£¨¼´¸ßµçÆ½£©ÇÒInput_StateÎª0x1000£¨¼´µÍµçÆ½£©Ê±	
	{
		Input_Rising_Edge |=0x1000;									  //Ñ¹Öı»úµçÔ´²úÉúÁËÒ»¸öÉÏÉıÑØ£¬±íÃ÷´Ë¿ÌÑ¹Öı»úÕıÔÚÉÏµç
	}
	else if((Old_Input_State & 0x1000) && ((Input_State & 0x1000)==0))//µ±Old_Input_StateÎª0x1000£¨¼´µÍµçÆ½£©ÇÒInput_StateÎª0xEFFF£¨¼´¸ßµçÆ½£©Ê±	
	{
		Input_Falling_Edge |=0x1000;								  //Ñ¹Öı»úµçÔ´²úÉúÁËÒ»¸öÏÂ½µÑØ£¬±íÃ÷´Ë¿ÌÑ¹Öı»úÕıÔÚ¶Ïµç
	}

//Ö»Òª¼ì²âµ½¿ªÃÅĞÅºÅ¾ÍÊÇÊÖ¶¯£¬¿ªÃÅÎª¸ßµçÆ½£¬¼´¿ØÖÆÆ÷ÊäÈëÎª¸ß£¬µ¥Æ¬»úIO¿Ú¼ì²âµ½µÍ£¬¼´GPIO_ReadInputDataBit(INPUT2)==0
//////////////--µ¥Æ¬»úIO¿ÚÎªµÍµçÆ½£¬Êµ¼ÊINPUT2Îª¸ßµçÆ½£¬---ÅĞ¶ÏÎªÊÖ¶¯Ä£Ê½////////////	
	if( doorOpenFlag == 1 )	  //¼ì²âµ½¿ªÃÅ±êÖ¾£¬´ú±íÊÖ¶¯Ä£Ê½
	{
		doorOpenFlag = 0;
		
		Flag = 2;
		if(Old_Flag != Flag)
		{
    		Mode_STATE = 'M';
            printf("¿ØÖÆÆ÷ÊäÈëµÍµçÆ½£¬ÊÖ¶¯Ä£Ê½\r\n");
    		USART3_SendWorld=26;  //·¢ËÍÃüÁî301
			Old_Flag = Flag;
		}				   
	}
    else if(doorCloseFlag == 1)    
    {
        doorCloseFlag = 0 ;

        Flag = 3;
		if(Old_Flag != Flag)
		{
    		Mode_STATE = 'A';
            printf("¿ØÖÆÆ÷ÊäÈë¸ßµçÆ½£¬×Ô¶¯Ä£Ê½\r\n");
    		USART3_SendWorld=28;  //·¢ËÍÃüÁî303
			Old_Flag = Flag;
		}				      
    }
}
/************************************************************************************
	º¯ÊıÃû£ºMJ_KMCounter()
	¹¦  ÄÜ£º¿ªÄ£Êı¾İÍ³¼Æ  £ºÄ£¾ßÉú²úµÄ¹¤¼şÊıÁ¿Í³¼Æ
	Êä  Èë£ºÎŞ
	Êä  ³ö£ºÎŞ
************************************************************************************/
void MJ_KMCounter(void)
{
/****************¿ªÄ£Êı¾İÍ³¼Æ*****************/
	if (USART3_SendWorld|= 0) return; //ÈôUSART3µÄ·¢ËÍ±êÖ¾×ÖÎª0£¬Ôò²»·¢ËÍÊı¾İ£¬¼ÌĞøµÈ´ı
	
	if(Input_Rising_Edge & 0x0001)	  //Èô³öÏÖ¿ªÄ£ÊäÈëÉÏÉıÑØ£¬Ôò½øĞĞÒ»´Î¼ÆÊı	
	{
		Input_Rising_Edge &=0xFFFE;	  //Ê×ÏÈ½«¿ªÄ£ÊäÈëÉÏÉıÑØ±êÖ¾Î»ÇåÁã£¬µÈ´ıÏÂÒ»´ÎÖÃÎ»
		
		MJ_Cnt++;				      //Ä£¾ß¼ÆÊı¼Ó1
		YG_Cnt++;				      //Ô±¹¤¼ÆÊı¼Ó1
	
		USART3_SendWorld=1;		      //½«USART3µÄ·¢ËÍ±êÖ¾×ÖÖÃ1£¬½øÈëÒÔÌ«ÍøÊı¾İ·¢ËÍÄ£Ê½
									  //Ã¿²É¼¯Ò»´Î¿ªÄ£Êı¾İ£¬¼´ÏòÒÔÌ«Íø·¢ËÍÒ»´Î
		
		User_Timer1sClear();		  //ÓÃ»§Ãë¶¨Ê±Æ÷Ê±ÖÓÇåÁã
		
		Nul_MuJuCount();		      //Ä£¾ßÎª¿ÕÊ±¿ªÄ£¼ÆÊı£¿£¿£¿£¿£¿£¿£¿£¿£¿£¿£¿£¿£¿£¿£¿£¿£¿£¿£¿£¿£¿
		
		return;
	}	
/*******************ÏµÍ³ÉÏµç¶Ïµç·¢ËÍ********************/
	if(Input_Rising_Edge & 0x1000) 	  //Èô³öÏÖÑ¹Öı»úAC220µçÔ´¿ªÆô
	{
		Input_Rising_Edge &=0xEFFF;	  //Ê×ÏÈ½«Ñ¹Öı»úµçÔ´¿ªÆôĞÅºÅÇåÁã£¬µÈ´ıÏÂÒ»´ÎÖÃÎ»
		Input_Flag |= 0x01;		      //Ñ¹Öı»úÉÏµç±êÖ¾Î»ÖÃÎ»£¬¿ªÊ¼Ñ¹Öı»úÉÏµçÊ±¼äÍ³¼Æ
		USART3_SendWorld=9;			  //ÈôUSART3µÄ·¢ËÍ±êÖ¾×ÖÎª9£¬Ôò·¢ËÍÏµÍ³ÉÏµçĞÅÏ¢112
		return;
	}
	if(Input_Falling_Edge & 0x1000)	  //Èô³öÏÖÑ¹Öı»úAC220µçÔ´¹Ø±ÕÊ±
	{
		Input_Falling_Edge &=0xEFFF;  //Ê×ÏÈ½«Ñ¹Öı»úµçÔ´¹Ø±ÕĞÅºÅÇåÁã£¬µÈ´ıÏÂÒ»´ÎÖÃÎ»
		Input_Flag &= 0xFE;		      //Ñ¹Öı»ú¶Ïµç±êÖ¾Î»ÖÃÎ»£¬½áÊøÑ¹Öı»úÉÏµçÊ±¼äÍ³¼Æ
		USART3_SendWorld=10;		  //ÈôUSART3µÄ·¢ËÍ±êÖ¾×ÖÎª10£¬·¢ËÍÏµÍ³¶ÏµçĞÅÏ¢113¼°ÆäÀÛ¼ÆÉÏµçÊ±¼ä
		return;
	}

}




